app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-08-12 23:51:54.539869"], ["updated_at", "2019-08-12 23:51:54.539869"]]

    def update
        set_school_class
        @school_class.update(school_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-08-13 00:19:58.833145"], ["id", 1]]